app/auth/authentication.rb

  def initialize(user)
    @email = user[:email]
    @password = user[:password]
    @user = User.find_by(email: @email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cristian@gmail.com"], ["LIMIT", 1]]