app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_character
    @character = Character.find(params[:id])