app/controllers/filmographies_controller.rb

SELECT "filmographies".* FROM "filmographies"
---
  def index
    @filmographies = Filmography.all

SELECT "filmographies".* FROM "filmographies" WHERE "filmographies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_filmography
    @filmography = Filmography.find(params[:id])