app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_genre
    @genre = Genre.find(params[:id])